"""
بسم الله الرحمن الرحیم

📚 معرفی کتابخانه ساخت ربات در پیام‌رسان گپ
کتابخانه‌ای ساده، قدرتمند و کاربرپسند برای ساخت ربات‌های هوشمند در پیام‌رسان گپ 🚀

با این کتابخانه، توسعه‌دهندگان عزیز می‌تونن به راحتی و بدون دردسر، ربات‌های اختصاصی خودشون رو با امکانات متنوع و انعطاف‌پذیر بسازن و به گپ اضافه کنن.
ساختار کتابخانه طوری طراحی شده که حتی اگر تازه‌کار باشی، بتونی خیلی سریع شروع کنی و اگر حرفه‌ای هستی، بتونی پروژه‌های پیچیده‌تر رو مدیریت کنی .

https://my.gap.im/doc/botplatform

نوشته شده با ❤️ توسط محمدرضا
"""

from .gap_bot import GapBot
from .get_chat_gap import GetChatGap

